Revit 2027 API
BuiltInFailures.CurtainWallFailures.CannotGroupCurtainGridHost Property
 Curtain grid based elements cannot be grouped.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotGroupCurtainGridHost { get; }
Public Shared ReadOnly Property CannotGroupCurtainGridHost As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotGroupCurtainGridHost {
	FailureDefinitionId^ get ();
}
static member CannotGroupCurtainGridHost : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CurtainWallFailures Class
Autodesk.Revit.DB Namespace